Revit 2015 API
Document.NewPipe Method
Adds a new pipe into the document.
Overload List
Name | Description
NewPipe(Connector, Connector, PipeType) |  Obsolete.
Adds a new pipe into the document, using two connectors and duct type.
NewPipe(XYZ, Connector, PipeType) |  Obsolete.
Adds a new pipe into the document, using a point, connector and pipe type.
NewPipe(XYZ, XYZ, PipeType) |  Obsolete.
Adds a new pipe into the document, using two points and pipe type.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace